In [1]:
b = open("data.txt","r")
b.close()

In [4]:
b = open("ram.txt","r")
c = b.read()
print(c)
b.close()

1. Hello World
2. Hello World
3. Hello World
4. Hello World
1. Hello World
2. Hello World
3. Hello World
4. Hello World

In [17]:
b = open("Tel.pdb","r")
c = b.readline(25)
print(c)
b.close()

HETATM    7  C1  UNK   90

In [15]:
b = open("Tel.pdb","r")
n = int(input("Enter n = "))
for i in range(1,n+1):
    if i != n:
        b.readline()
    else: 
        c = b.readline
        print(c)
b.close()

Enter n = 10
<built-in method readline of _io.TextIOWrapper object at 0x000002D324E92AD0>

In [18]:
b = open("Tel.pdb","r")
c = b.read()
d = c.split
print(d)
b.close()

<built-in method split of str object at 0x000002D3247B64F0>

In [19]:
s =""
net_total = 0
# s = str()
n = int(input("Enter n = "))
b = open("bill.txt","w")
for i in range(n):
    name = input("Enter name = ")
    price = int(input("Enter price = "))
    quantity = int(input("Enter qty = "))
    total = quantity *price
    s = s+f"{name} {price} {quantity} {total}\n"
    net_total = net_total+price
    
print("The bill is\n",s)
print("The totak is = ",total)
b.write(s)
b.close()

Enter n = 3
Enter name = ram
Enter price = 65
Enter qty = 65
Enter name = Hari
Enter price = 68
Enter qty = 57
Enter name = Shyam
Enter price = 65
Enter qty = 85
The bill is
 ram 65 65 4225
Hari 68 57 3876
Shyam 65 85 5525

The totak is =  5525

In [20]:
import os
os.remove("bill.txt")

In [21]:
s =""
net_total = 0
# s = str()
n = int(input("Enter n = "))
b = open("bill.txt","w")
for i in range(n):
    name = input("Enter name = ")
    price = int(input("Enter price = "))
    quantity = int(input("Enter qty = "))
    total = quantity *price
    s = s+f"{name} {price} {quantity} {total}\n"
    net_total = net_total+price
    
print("The bill is\n",s)
print("The totak is = ",total)
b.write(s)
b.close()

Enter n = 2
Enter name = Ram
Enter price = 25
Enter qty = 35
Enter name = Hari
Enter price = 65
Enter qty = 63
The bill is
 Ram 25 35 875
Hari 65 63 4095

The totak is =  4095

In [22]:
import shutil
src = 'bill.txt'
dst = 'Santosh'
shutil.copy(src,dst)

'Santosh\\bill.txt'

In [1]:
b = open("data.csv","x")
b.close()

FileExistsError: [Errno 17] File exists: 'data.csv'

In [3]:
b = open("data.csv","r")
print(b.read())
b.close()

SN,Name,Age,Address
1,Ram,23,Kathmandu
2,Shyam,45,Bara
3,Nabin,54,Pokhara
4,Santosh,45,Slolu
5,Aayush,64,KTM
6,Hari,43,Jhapa

In [3]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5)
df.head(3)

   SN   Name  Age    Address
0   1    Ram   23  Kathmandu
1   2  Shyam   45       Bara
2   3  Nabin   54    Pokhara

In [5]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN",usecols = ["SN","Name"])
df.head(3)

     Name
SN
1     Ram
2   Shyam
3   Nabin

In [11]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN")
df[df["Address"] == "KTM"]

      Name  Age Address
SN
5   Aayush   64     KTM

In [12]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN",usecols = ["SN","Name"])
df.iloc[0:4]

       Name
SN
1       Ram
2     Shyam
3     Nabin
4   Santosh

In [3]:
b = open("data.csv","r")
print(b.read())
b.close()

SN,Name,Age,Address
1,Ram,23,Kathmandu
2,Shyam,45,Bara
3,Nabin,54,Pokhara
4,Santosh,45,Slolu
5,Aayush,64,KTM
6,Hari,43,Jhapa

In [4]:
import pandas as pd
df = pd.read_csv("data.csv")
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM
5   6     Hari   43      Jhapa

In [2]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5)
print(df)

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM

In [4]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN")
df.head(3)

     Name  Age    Address
SN
1     Ram   23  Kathmandu
2   Shyam   45       Bara
3   Nabin   54    Pokhara

In [5]:
import pandas as pd
df = pd.read_csv("data.csv",usecols = ['SN','Name','Age','Address'])
print(df)

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM
5   6     Hari   43      Jhapa

In [8]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN")
df[df["Age"]>30]

       Name  Age  Address
SN
2     Shyam   45     Bara
3     Nabin   54  Pokhara
4   Santosh   45    Slolu
5    Aayush   64      KTM
6      Hari   43    Jhapa

In [15]:
import pandas as pd
df = pd.read_csv("data.csv")
df[(df["Name"] == 'Santosh') & (df["Age"]>30)]

   SN     Name  Age Address
3   4  Santosh   45   Slolu

In [22]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "Name")
df.loc["Ram":"Hari"]

         SN  Age    Address
Name
Ram       1   23  Kathmandu
Shyam     2   45       Bara
Nabin     3   54    Pokhara
Santosh   4   45      Slolu
Aayush    5   64        KTM
Hari      6   43      Jhapa

In [31]:
df.drop(["Santosh"], axis = 0)

        SN  Age    Address
Name
Ram      1   23  Kathmandu
Shyam    2   45       Bara
Nabin    3   54    Pokhara
Aayush   5   64        KTM
Hari     6   43      Jhapa

In [28]:
df.drop(["Address"], axis = 1)

         SN  Age
Name
Ram       1   23
Shyam     2   45
Nabin     3   54
Santosh   4   45
Aayush    5   64
Hari      6   43

In [33]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "Name")
fd = df['Ram':'Santosh']

fd.to_csv("filtered_data.csv")

In [34]:
import csv
fields = ["Hari",45,'Kathmandu']
with open('santosh.csv','a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [35]:
import csv
fields = ["Hari",45,'Kathmandu']
f = open('santsoh.csv','a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [37]:
result = []
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics = int(input("Enter marks"))
    chemistry = int(input("Enter marks"))
    math = int(input("Enter marks"))
    english = int(input("Enter marks"))
    total = sum([physics,chemistry,math,english])
    per = total/4
    marks = [i,name,physics,chemistry,math,english,total,per]
    result.append(marks)
print(result)

Enter n = 3
Enter name = Santosh
Enter marks65
Enter marks56
Enter marks85
Enter marks56
Enter name = Hari
Enter marks56
Enter marks58
Enter marks5
Enter marks75
Enter name = Ram
Enter marks25
Enter marks36
Enter marks56
Enter marks56
[[1, 'Santosh', 65, 56, 85, 56, 262, 65.5], [2, 'Hari', 56, 58, 5, 75, 194, 48.5], [3, 'Ram', 25, 36, 56, 56, 173, 43.25]]

In [38]:
import csv
f = open('result.csv','w')
x = csv.writer(f)
for i in result:
    x.writerow(i)
f.close()

In [39]:
import csv
f = open('result.csv','w')
x = csv.writer(f)
x.writerow(["SN","Name","Physics","Chemistry","Math","English","Total","Percentage"])
for i in result:
    x.writerow(i)
f.close()

In [44]:
import pandas as pd
df = pd.read_csv("result.csv")
df

   SN     Name  Physics  Chemistry  Math  English  Total  Percentage
0   1  Santosh       65         56    85       56    262       65.50
1   2     Hari       56         58     5       75    194       48.50
2   3      Ram       25         36    56       56    173       43.25

In [46]:
a = {'Santosh': ['9865623658', '9865986586', '09883874837'], 'Ram': ['9685689575', '9856895648', '98776543']}
df = pd.DataFrame(a)
df

       Santosh         Ram
0   9865623658  9685689575
1   9865986586  9856895648
2  09883874837    98776543

In [47]:
a = {'Santosh': ['9865623658', '9865986586', '09883874837'], 'Ram': ['9685689575', '9856895648', '98776543']}
df = pd.DataFrame(a)
df.to_csv('call.csv')

In [48]:
import pandas as pd
df = pd.read_csv("call.csv")
df

   Unnamed: 0     Santosh         Ram
0           0  9865623658  9685689575
1           1  9865986586  9856895648
2           2  9883874837    98776543

In [49]:
import csv
b = open("filtered_data.csv")
reader = csv.DictReader(b)
for row in reader:
    print(row)

{'Name': 'Ram', 'SN': '1', 'Age': '23', 'Address': 'Kathmandu'}
{'Name': 'Shyam', 'SN': '2', 'Age': '45', 'Address': 'Bara'}
{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}

In [50]:
import csv
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    print(dict(row))

{'Name': 'Ram', 'SN': '1', 'Age': '23', 'Address': 'Kathmandu'}
{'Name': 'Shyam', 'SN': '2', 'Age': '45', 'Address': 'Bara'}
{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}

In [51]:
import pandas as pd
df = pd.read_csv('filtered_data.csv')
df

      Name  SN  Age    Address
0      Ram   1   23  Kathmandu
1    Shyam   2   45       Bara
2    Nabin   3   54    Pokhara
3  Santosh   4   45      Slolu

In [52]:
import csv
final_data = []
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    final_data.append(dict(row))
print(final_data)

[{'Name': 'Ram', 'SN': '1', 'Age': '23', 'Address': 'Kathmandu'}, {'Name': 'Shyam', 'SN': '2', 'Age': '45', 'Address': 'Bara'}, {'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}, {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}]

In [53]:
final_data[0]["Name"] = "Chor"
final_data

[{'Name': 'Chor', 'SN': '1', 'Age': '23', 'Address': 'Kathmandu'},
 {'Name': 'Shyam', 'SN': '2', 'Age': '45', 'Address': 'Bara'},
 {'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'},
 {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}]

In [54]:
import csv
csv_columns = ['Name', 'SN', 'Age', 'Address']
dict = final_data

b = open("filtered_data.sv","w")
writer = csv.DictWriter(b, fieldnames = csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
b.close()

In [3]:
import mysql.connector
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class6pm"
)
db = database.cursor()

In [7]:
db.execute("SELECT * FROM product1")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Acer Laptop', 555555, 666666, 'This is the latest laptop', 56, datetime.datetime(2021, 6, 18, 15, 0, 28), 66)
(2, 'Samsung Laptop', 10000, 11111111, 'This is the latest laptop', 45, datetime.datetime(2021, 6, 18, 15, 2, 18), 12)

In [8]:
db.execute("SELECT name,cost_price,sell_price FROM  product1")
result = db.fetchall()
for x in result:
    print(x)

('Acer Laptop', 555555, 666666)
('Samsung Laptop', 10000, 11111111)

In [9]:
db.execute("SELECT name,cost_price,sell_price FROM  product1 WHERE stock>15")
result = db.fetchall()
for x in result:
    print(x)

('Acer Laptop', 555555, 666666)

In [12]:
db.execute("SELECT name,cost_price,sell_price FROM  product1 WHERE description LIKE '%This%'")
result = db.fetchall()
for x in result:
    print(x)

('Acer Laptop', 555555, 666666)
('Samsung Laptop', 10000, 11111111)

In [19]:
name = "keyboard"
cost_price = 200
sell_price = 500
description = "This is the gaming keyboard"
quantity = 25
stock = 56
sql = f"INSERT INTO product1(name,cost_price,sell_price,description,quantity,stock) VALUES('{name}',{cost_price},{sell_price},'{description}',{quantity},{stock})"
print(sql)    
db.execute(sql)
database.commit()

INSERT INTO product1(name,cost_price,sell_price,description,quantity,stock) VALUES('keyboard',200,500,'This is the gaming keyboard',25,56)

In [20]:
sql = "DELETE FROM product1 WHERE id = 3"
db.execute(sql)
database.commit()

In [26]:
sql = "UPDATE product1 SET stock = 45 WHERE id  = 1"
db.execute(sql)
database.commit()

In [2]:
class Hello:
    print("Hello World")

obj = Hello()

Hello World

In [3]:
class Cal:
    l = 4
    b = 5
    h = 3
    v = l*b*h
    print(v)

60

In [4]:
class Cal:
    def volume(self):
        l = 4
        b = 5
        h = 3
        v = l*b*h
        print(v)
obj = Cal()
obj.volume()

60

In [6]:
class Cal:
    def volume(self,l,b,h):
       
        v = l*b*h
        print(v)
l = 4
b = 5
h = 3
obj = Cal()
obj.volume(l,b,h)

60

In [7]:
class Cal:
    def __init__(self,l,b,h):  #constructor  
        self.l = l #aghadi j vayeni paxadi same 
        self.b = b
        self.h = h
        
    def volume(self): 
        v = self.l*self.b*self.h
        print(v)
    def area(self):
        a = self.l*self.b
        print(a)
l = 4
b = 5
h = 3    
obj = Cal(l,b,h)
obj.volume()  
obj.area()

60
20

In [10]:
class Cal:
    def __init__(self,l,b):  
        self.l = l  
        self.b = b
                
    def volume(self,h): 
        v = self.l*self.b*h
        return v
    
    def area(self):
        a = self.l*self.b
        return a
    
l = int(input("Enter l = "))
b = int(input("Enter l = "))
    
obj = Cal(l,b)
print(obj.volume(h))  
print(obj.area())

Enter l = 25
Enter l = 25
22500
625

In [1]:
class Hello:
    print("Hello World")
obj = Hello()

Hello World

In [2]:
class cal:
    l = 1
    b = 3
    h = 5
    v = l*b*h
    print(v)

15

In [2]:
class Cal:
    l = 2
    b = 4
    h = 4
    v = l*b*h
    print(v)
    
obj = Cal()

32

In [3]:
class Cal:
    def volume(self):
        l = 2
        b = 4
        h = 4
        v = l*b*h
        print(v)
    
obj = Cal()
obj.volume()

32

In [4]:
class Cal:
    def volume(self,l,b,h):
        v = l*b*h
        print(v)
        
l = 4
b = 5
h = 4

obj = Cal()
obj.volume(l,b,h)

80

In [3]:
class Cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
        
    def volume(self):
        v = self.l*self.b*self.h
        print(v)
    def area(self):
        a = self.l*self.b
        print(a)
        
l = 4
b = 4
h = 5
obj = Cal(l,b,h)
obj.volume()
obj.area()

80
16

In [6]:
class Cal:
    def __init__(self,l,b):
        self.l = l
        self.b = b
    def __str__(self):
        return str(self.l)
    
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = Cal(l,b)
x = obj.volume(h)
y = obj.area()
type(x),type(y)
print(obj)

Enter l = 25
Enter b = 25
Enter h = 65

AttributeError: 'Cal' object has no attribute 'volume'

In [1]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def __repr__(self):
        v = self.l*self.b*self.h
        vo = {"Volume":v}
        return vo
l = int(int(input("Enter l =")))
b = int(int(input("Enter b = ")))
h = int(int(input("Enter h = ")))
obj = cal(l,b,h)
print(obj.__repr__())

Enter l =5
Enter b = 56
Enter h = 56
{'Volume': 15680}

In [2]:
class Cal:
    def __init__(self,l,b,h):  
        self.l = l  
        self.b = b
        self.h = h
    def __repr__(self): #for tabular 
        v = self.l*self.b*self.h
        vo = {"Volume":v}
        return vo
    
l = int(input("Enter l = "))
b = int(input("Enter l = "))
h = int(input("Enter l = "))    
obj = Cal(l,b,h)
print(obj.__repr__())
print(type(obj.__repr__()))

Enter l = 56
Enter l = 56
Enter l = 58
{'Volume': 181888}
<class 'dict'>

In [7]:
class Point:
    def __init__(self,x = 0, y = 0):
        self.x = x
        self.y = y
    def __str__(self):
        return "({0},{1})".format(self.x,self.y) #string format
    def __subtract__(self,other):
        x = self.x-other.x
        y = self.y-other.y
        return Point(x,y)
p1 = Point(2,3)
p2 = Point(-1,2)
print(p1-p2)
print(type((p1-p2)))

TypeError: unsupported operand type(s) for -: 'Point' and 'Point'

In [8]:
class Point:
    def __init__(self,x = 0):
        self.x = x
        print("This is init function",self.x)
    def __str__(self):
        print("This is str method",self.x)
        return f"{self.x}"
    def __add__(self,other):
        x = self.x+other.x
        print("This is add method",x)
    
        return Point(x)
p1 = Point(1000)
p2 = Point(2000)
p3 = Point(3455)
print(p1+p2+p3)

This is init function 1000
This is init function 2000
This is init function 3455
This is add method 3000
This is init function 3000
This is add method 6455
This is init function 6455
This is str method 6455
6455

In [9]:
class Point:
    def __init__(self,x = 0):
        self.x = x
        
    def __str__(self):
        return f"{self.x}"
    def __add__(self,other):
        x = self.x+other.x
            
        return Point(x)
p1 = Point(1000)
p2 = Point(2000)
p3 = Point(3455)  #for dynamic programme
print(p1+p2+p3)

6455

In [10]:
class Parrot:
    def fly(self): #polymerphism
        print("Parrot can fly")
    def swim(self):
        print("Parrot can't swim")
        
class Penguin:
    def fly(self):
        print("Penguin can't fly")
    def swim(self):
        print("Penguin can swim")
        
#common interface
def flying_test(bird):
    bird.fly()
#instantiate objects
blu = Parrot()
peggy = Penguin()
#passing the object
flying_test(blu)
flying_test(peggy)

Parrot can fly
Penguin can't fly

In [11]:
class A:
    pass
class B(A):
    pass
obj = B()

In [12]:
class Profile: #inteheritance arko class bat copy
    def __init__(self):
        self.l = int(input("Enter l = "))
        self.b = int(input("Enter b = "))
        self.a = self.l*self.b
        
class Hr(Profile):
    def area(self):
        print("The area is ",self.a)
obj = Hr()
obj.area()

Enter l = 5
Enter b = 6
The area is  30

In [13]:
class area: #inteheritance arko class bat copy
    def __init__(self):
        self.l = int(input("Enter l = "))
        self.b = int(input("Enter b = "))
        self.a = self.l*self.b
        
class volume(Profile):
    def __init__(self,h): #talko h initialize
        self.h = h
        area.__init__(self) #copy from above
    def volume(self):
        v = self.a*self.h
        print("The volume is ",v)
obj = volume(10)
obj.volume()

Enter l = 4
Enter b = 54
The volume is  2160

In [3]:
class A:
    def __init__(self,add):
        self.add = add
class B(A):
    def __init__(self,age,add):
        self.age = age
        A.__init__(self,add)
class C(B):
    def __init__(self,name,age,add):
        self.name = name
        B.__init__(self,age,add)
obj = C("Ram",34,"Kathmandu")
print(obj.name)
print(obj.age)

Ram
34

In [4]:
class A:
    def __init__(self,add):
        self.add = add
class B:
    def __init__(self,age):
        self.age = age
class C(A,B):
    def __init__(self,name,age,add):
        self.name = name
        B.__init__(self,age)
        A.__init__(self,add)
obj = C("Ram",23,"Kathmandu")
print(obj.name)
print(obj.age)
print(obj.add)

Ram
23
Kathmandu

In [5]:
class A:
    def __init__(self):
        self.add = input("Enter add = ")
class B:
    def __init__(self):
        self.age = int(input("Enter age"))
class C(A,B):
    def __init__(self):
        self.name = input("Enter name = ")
        B. __init__(self)
        A. __init__(self)
obj = C()
print(obj.name)
print(obj.age)
print(obj.add)

Enter name = ram
Enter age25
Enter add = kathmandu
ram
25
kathmandu

In [6]:
class profile:
    def __init__(self):
        self.name = "Ram"
        self.age = 23
        self.add = "Kathmandu"
obj = profile()
print(obj.name)
print(obj.age)
print(obj.add)

Ram
23
Kathmandu

In [8]:
class profile:
    def __init__(self):
        self._name = "Ram"
        self._age = 23
        self._add = "Kathmandu"
obj = profile()
print(obj._name)
print(obj._age)
print(obj._add)

Ram
23
Kathmandu

In [10]:
class profile:
    def __init__(self):
        self.__name = "Ram"
        self.__age = 23
        self.__add = "Kathmandu"
obj = profile()
print(obj._profile__name)
print(obj._profile__age)
print(obj._profile__add)

Ram
23
Kathmandu

In [11]:
class A: 
    def __init__(self):
        self._add = input("Enter add =")
class B:
    def __init__(self):
        self.__age = int(input("Enter age ="))
        self.ag = 23
        
class C(A,B):
    def __init__(self):
        self.name = input("Enter name =")
        B. __init__(self)
        A. __init__(self)
    def info(self):
        print("Hello I am {self.name}. Iam from{self._add}. Iam {self.ag}")
obj = C()
print(obj.name)
obj.info()

Enter name =2
Enter age =5
Enter add =5
2
Hello I am {self.name}. Iam from{self._add}. Iam {self.ag}

In [12]:
#super function
class Profile: 
    def __init__(self):
        self.l = int(input("Enter l = "))
        self.b = int(input("Enter b = "))
        self.a = self.l*self.b
    def area(self):
        a = self.l*self.b
        return a
        
class Hr(Profile):
    def area(self):
        ar = super().area()
        print("The area is ",ar)
obj = Hr()
obj.area()

Enter l = 25
Enter b = 52
The area is  1300

In [1]:
class hello:
    print("Hello world")
obj = hello()

Hello world

In [4]:
class cal:
    l = 4
    b = 5
    h = 5
    v = l*b*h
    
obj = cal()

In [7]:
class Cal:
    def volume(self):
        l = 4
        b = 5
        h = 5
        v = l*b*h
        print(v)
obj = Cal()
obj.volume()

100

In [8]:
class Cal:
    def volume(self,l,b,h):
        v = l*b*h
        print(v)
l = 4
b = 5
h = 6
obj = Cal()
obj.volume(l,b,h)

120

In [9]:
class Cal:
    def volume(self,l,b,h):
        v = l*b*h
        print(v)
    def area(self,l,b):
        a = l*b
        print(a)
l = 4
b = 5
h = 4
obj = Cal()
obj.volume(l,b,h)
obj.area(l,b)

80
20

In [11]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def volume(self):
        v = self.l*self.b*self.h
        print(v)
    def area(self):
        a = self.l*self.b
        print(a)
l = 4
b = 5
h = 6
obj = cal(l,b,h)
obj.volume()
obj.area()

120
20

In [14]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def volume(self):
        v = self.l*self.b*self.h
        print(v)
    def area(self):
        a = self.l*self.b
        print(a)
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b,h)
obj1 = cal(10,4,5)
obj1.volume()
obj1.area()
obj.volume()
obj.area()

Enter l = 5
Enter b = 5
Enter h = 5
200
40
125
25

In [15]:
class Cal:
    def __init__(self,l,b):  #constructor automatc initialization
        self.l = l #aghadi j vayeni paxadi same 
        self.b = b
                
    def volume(self,h): #
        v = self.l*self.b*h
        print(v)
    def area(self):
        a = self.l*self.b
        print(a)
l = int(input("Enter l = "))
b = int(input("Enter l = "))
h = int(input("Enter l = "))    
obj = Cal(l,b)
obj.volume(h)  
obj.area()

Enter l = 5
Enter l = 5
Enter l = 5
125
25

In [16]:
class cal:
    def __init__(self,l,b):
        self.l = l
        self.b = b
    def volume(self,h):
        v= self.l*self.b*h
        return v
    def area(self):
        a = self.l*self.b
        return a
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b)
print(obj.volume(h))
print(obj.area())

Enter l = 5
Enter b = 6
Enter h = 5
150
30

In [17]:
class Cal:
    def __init__(self,l,b):  
        self.l = l  
        self.b = b
                
    def volume(self,h): 
        v = self.l*self.b*h
        return v
    
    def area(self):
        a = self.l*self.b
        return a
    
l = int(input("Enter l = "))
b = int(input("Enter l = "))
h = int(input("Enter l = "))    
obj = Cal(l,b)
x = obj.volume(h)
y = obj.area()
type(x),type(y)

Enter l = 5
Enter l = 5
Enter l = 5

(int, int)

In [18]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def __str__(self):
        return str(self.l)
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b,h)
print(obj)

Enter l = 5
Enter b = 6
Enter h = 5
5

In [21]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def __str__(self):
        v = self.l*self.b*self.h
        return str(v)
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b,h)
print(obj)
print(type(obj))

Enter l = 5
Enter b = 6
Enter h = 8
240
<class '__main__.cal'>

In [23]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def __str__(self):
        v = self.l*self.b*self.h
        return str(v)
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b,h)
print(str(obj)+" object")
print(type(obj))

Enter l = 5
Enter b = 5
Enter h = 5
125 object
<class '__main__.cal'>

In [31]:
class cal:
    def __init__(self,l,b,h):
        self.l = l
        self.b = b
        self.h = h
    def __repr__(self):
        v = self.l*self.b*self.h
        vo = {"Volume":v}
        return vo
l = int(input("Enter l = "))
b = int(input("Enter b = "))
h = int(input("Enter h = "))
obj = cal(l,b,h)
print(obj.__repr__())
print(type(obj.__repr__()))

Enter l = 5
Enter b = 5
Enter h = 5
{'Volume': 125}
<class 'dict'>

In [32]:
class point:
    def __init__(self,x = 0, y = 0):
        self.x = x
        self.y = y
    def __str__(self):
        return "({0},{1})".format(self.x,self.y)
    def __add__(self,other):
        x = self.x+other.x
        y = self.y+other.y
        return point(x,y)
p1 = point(2,3)
p2 = point(-1,4)
print(p1+p2)

(1,7)

In [33]:
class point:
    def __init__(self,x = 0, y = 0):
        self.x = x
        self.y = y
    def __str__(self):
        return f"{self.x}{self.y}"
    def __add__(self,other):
        x = self.x+other.x
        y = self.y+other.y
        return point(x,y)
p1 = point(3,4)
p2 = point(-3,5)
print(p1+p2)

09

In [34]:
class point:
    def __init__(self,x = 0):
        self.x = x
        print("This is init function",self.x)
    def __str__(self):
        print("This is str method",self.x)
        return f"{self.x}"
    def __add__(self,other):
        x = self.x+other.x
        print("This is add method",x)
        
        return point(x)
p1 = point(2222)
p2 = point(33344)
p3 = point(34644)
print(p1+p2+p3)

This is init function 2222
This is init function 33344
This is init function 34644
This is add method 35566
This is init function 35566
This is add method 70210
This is init function 70210
This is str method 70210
70210

In [39]:
class Parrot:
    def fly(self):
        print("parrot can fly")
    def swim(self):
        print("parrot can't swim")
class Penguin:
    def fly(self):
        print("Penguin can't fly")
    def swim(self):
        print("Penguin can swim")
def flying_test(bird):
    bird.fly()
blu = Parrot()
peggy = Penguin()

flying_test(blu)
flying_test(peggy)

parrot can fly
Penguin can't fly

In [40]:
class profile:
    def __init__(self):
        self.l = int(input("Enter l "))
        self.b = int(input("Enter b = "))
        self.h = int(input("Enter h = "))
        self.a = self.l*self.b
class hr(profile):
    def area(self):
        print("The area is ",self.a)
obj = hr()
obj.area()

Enter l 5
Enter b = 5
Enter h = 4
The area is  25

In [41]:
class profile:
    def __init__(self):
        self.l = int(input("Enter l "))
        self.b = int(input("Enter b = "))
        self.h = int(input("Enter h = "))
        self.a = self.l*self.b
class volume(profile):
    def volume(self):
        v = self.a*self.h
        print("This volume is",v)
obj = volume()
obj.volume()

Enter l 5
Enter b = 5
Enter h = 5
This volume is 125

In [48]:
class A:
    def __init__(self,add):
        self.add =add
class B:
    def __init__(self,age):
        self.age = age
        
class C(B,A):
    def __init__(self,name,age,add):
        self.name = name
        B.__init__(self,age)
        A.__init__(self,add)
obj = C("Ram",34,"Kathmandu")
print(obj.name)
print(obj.age)
print(obj.add)

Ram
34
Kathmandu

In [49]:
# private__
class Profile:
    def __init__(self):
        self.__name = "Ramm"
        self.__age= 23
        self.__add = "Kathmandu"
obj = Profile()
print(obj._Profile__name) #for debuging purpose only
print(obj._Profile__age)
print(obj._Profile__add)

Ramm
23
Kathmandu

In [3]:
b = open("data.csv","x")
b.close()

FileExistsError: [Errno 17] File exists: 'data.csv'

In [6]:
b = open('data.csv','r')
print(b.read())
b.close()

SN,Name,Age,Address
1,Ram,23,Kathmandu
2,Shyam,45,Bara
3,Nabin,54,Pokhara
4,Santosh,45,Slolu
5,Aayush,64,KTM
6,Hari,43,Jhapa

In [7]:
import pandas as pd
df = pd.read_csv("data.csv")
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM
5   6     Hari   43      Jhapa

In [1]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5)
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM

In [2]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5)
df.head(3)

   SN   Name  Age    Address
0   1    Ram   23  Kathmandu
1   2  Shyam   45       Bara
2   3  Nabin   54    Pokhara

In [5]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5,index_col = "SN",usecols = ["SN","Name","Age"])
df.tail(3)

       Name  Age
SN
3     Nabin   54
4   Santosh   45
5    Aayush   64

In [6]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5,index_col = "SN",usecols = ["SN","Name","Age"])
df["Age"]

SN
1    23
2    45
3    54
4    45
5    64
Name: Age, dtype: int64

In [7]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5,index_col = "SN",usecols = ["SN","Name","Age"])
df["Age"]>40

SN
1    False
2     True
3     True
4     True
5     True
Name: Age, dtype: bool

In [8]:
import pandas as pd
df = pd.read_csv("data.csv",index_col="SN")
df[df["Age"]>45]

      Name  Age  Address
SN
3    Nabin   54  Pokhara
5   Aayush   64      KTM

In [10]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN")
df[df["Address"] == "KTM"]

      Name  Age Address
SN
5   Aayush   64     KTM

In [14]:
import pandas as pd
df = pd.read_csv('data.csv')
df[(df['Address'] == "KTM") & (df['Age']>10]

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (<ipython-input-14-406a02656c8f>, line 3)

In [16]:
import pandas as pd
df = pd.read_csv("data.csv")
df.iloc[0:4,0:4]

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu

In [17]:
import pandas as pd
df = pd.read_csv("data.csv")
df.iloc[0:4,0:5]

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu

In [18]:
import pandas as pd
df = pd.read_csv("data.csv")
df.iloc[2:5]

   SN     Name  Age  Address
2   3    Nabin   54  Pokhara
3   4  Santosh   45    Slolu
4   5   Aayush   64      KTM

In [22]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "Name")
fd = df['Nabin':'Aayush']
fd.to_csv("filtered_data.csv")

In [23]:
import csv
fields = ['Ram',34,'Kathmandu']
with open('copy.csv','a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [24]:
import csv
fields = ['Kamal',29,'Kathamndu']
f = open('copy.csv','a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [3]:
finalresult = []
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics = int(input("Enter physics"))
    chemistry = int(input("Enter chemsitry = "))
    total = sum([physics,chemistry])
    per = total/2
    marks = [i,name,physics,chemistry,total,per]
    finalresult.append(marks)
print(finalresult)

Enter n = 1
Enter name = Ram
Enter physics25
Enter chemsitry = 25
[[1, 'Ram', 25, 25, 50, 25.0]]

In [4]:
import csv
f = open('finalresult.csv','w')
x = csv.writer(f)
for i in finalresult:
    x.writerow(i)
f.close()

In [5]:
import csv
f = open('finalresult.csv','w')
x = csv.writer(f)
x.writerow(["SN","Name","Physics","Chemistry","Total","Per"])
for i in finalresult:
    x.writerow(i)
f.close()

In [2]:
import pandas as pd
a = {'Santosh': ['9865623658', '9865986586'], 'Ram': ['9685689575', '9856895648']}
df = pd.DataFrame(a)
df

      Santosh         Ram
0  9865623658  9685689575
1  9865986586  9856895648

In [3]:
import csv
b = open('filtered_data.csv') #dictreader
reader = csv.DictReader(b) #without pandas read for update delete
for row in reader:
    print(row)

{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}
{'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}

In [4]:
import csv
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    print(dict(row))

{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}
{'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}

In [5]:
import pandas as pd
df = pd.read_csv('filtered_data.csv') #
df

      Name  SN  Age  Address
0    Nabin   3   54  Pokhara
1  Santosh   4   45    Slolu
2   Aayush   5   64      KTM

In [6]:
import csv #for update
final_data=[]
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    final_data.append(dict(row))
print(final_data)

[{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}, {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}, {'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}]

In [7]:
final_data[0]["Name"] = "Ramprasad"
final_data

[{'Name': 'Ramprasad', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'},
 {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'},
 {'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}]

In [9]:
import mysql.connector
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class6pm"
)
db = database.cursor()

ModuleNotFoundError: No module named 'mysql'